result/001-1.general-vm-general-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      89.97
    writes/s:                     59.98
    fsyncs/s:                     183.25

Throughput:
    read, MiB/s:                  1.41
    written, MiB/s:               0.94

General statistics:
    total time:                          10.0016s
    total number of events:              3333

Latency (ms):
         min:                                  0.00
         avg:                                  3.00
         max:                                 42.20
         95th percentile:                     13.95
         sum:                               9999.17

Threads fairness:
    events (avg/stddev):           3333.0000/0.00
    execution time (avg/stddev):   9.9992/0.00