result/001-3.general-vm-premium-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      47.95
    writes/s:                     31.97
    fsyncs/s:                     95.90

Throughput:
    read, MiB/s:                  0.75
    written, MiB/s:               0.50

General statistics:
    total time:                          10.0094s
    total number of events:              1760

Latency (ms):
         min:                                  0.00
         avg:                                  5.69
         max:                                172.57
         95th percentile:                     20.37
         sum:                              10007.64

Threads fairness:
    events (avg/stddev):           1760.0000/0.00
    execution time (avg/stddev):   10.0076/0.00