result/002-3.cpu-vm-premium-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      55.28
    writes/s:                     36.78
    fsyncs/s:                     115.15

Throughput:
    read, MiB/s:                  0.86
    written, MiB/s:               0.57

General statistics:
    total time:                          10.0031s
    total number of events:              2073

Latency (ms):
         min:                                  0.00
         avg:                                  4.82
         max:                                 66.79
         95th percentile:                     18.61
         sum:                              10001.35

Threads fairness:
    events (avg/stddev):           2073.0000/0.00
    execution time (avg/stddev):   10.0013/0.00