result/003-1.memory-vm-general-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      83.93
    writes/s:                     55.95
    fsyncs/s:                     173.95

Throughput:
    read, MiB/s:                  1.31
    written, MiB/s:               0.87

General statistics:
    total time:                          10.0074s
    total number of events:              3141

Latency (ms):
         min:                                  0.00
         avg:                                  3.19
         max:                                 27.14
         95th percentile:                     14.73
         sum:                              10004.79

Threads fairness:
    events (avg/stddev):           3141.0000/0.00
    execution time (avg/stddev):   10.0048/0.00