result/003-3.memory-vm-premium-volume-io.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: 0
128 files, 4GiB each
512GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      47.92
    writes/s:                     31.95
    fsyncs/s:                     100.63

Throughput:
    read, MiB/s:                  0.75
    written, MiB/s:               0.50

General statistics:
    total time:                          10.0153s
    total number of events:              1808

Latency (ms):
         min:                                  0.00
         avg:                                  5.54
         max:                                309.78
         95th percentile:                     20.37
         sum:                              10013.35

Threads fairness:
    events (avg/stddev):           1808.0000/0.00
    execution time (avg/stddev):   10.0133/0.00